[
  {
    "id": 0,
    "title": "The Lowe's Rooftop Party",
    "author": "Abel Lu",
    "date": "June 28th, 2023",
    "body": "Welcome to my first blog post! This entry is one of (hopefully) many more to come in the future. In this inaugural entry, I'll be writing about a recent event I attended as a Lowe's software engineer intern: the rooftop party, made possible through a joint effort with the Charlotte Regional Business Alliance. For those that don't know, Lowe's is a home improvement giant boasting over $96 billion in sales in 2021. The Charlotte Regional Business Alliance, on the other hand, is an organization dedicated to advocating for business and growing the economy in the Charlotte region. Throughout my internship here, Lowe's has consistently provided opportunities for interns to network and socialize in fun and friendly environments. The rooftop party is just one example!<br/><br/> On June 28th, 2023, all 160 Lowe's interns from all sectors were invited to join a party hosted in partnership by Lowe's and the Charlotte Business Alliance, and taking place on the rooftop of the Lowe's Tech Hub. I had the pleasure of attending this event with some of my fellow software engineer interns (pictures above) right after getting off of work a few floors below. <br/><br/> The rooftop party was catered with fresh local food, which included mini birria tacos, charcuterie cones, and my personal favorite: the chicken sandwiches. Drinks, including strawberry and blueberry lemonade, were also served. Lowe's and the Charlotte Regional Business Alliance were also able to bring in custom-built arcade machines made by Potions & Pixels, a local non-profit game organization, which featured dozens of unique games designed and developed by some of Charlotte's local creators. Between the food, the friends, and the fun, I had an amazing time at this event! <br/><br/> As I near the end of my first software engineering internship here at Lowe's, I'm reflecting greatly on the things that have made Lowe's such a great place to work. For one, events like the rooftop party were definitely a great factor. A recent shift in working culture has led more and more workers to desire remote work. However, the efforts that Lowe's puts into hosting social events has reminded me the value of spending meaningful time with co-workers. Beyond just working  and doing business together, there can be friendships and camaraderie waiting to happen!",
    "imageUrl": "https://raw.githubusercontent.com/azn-abel/azn-abel/main/images/lowes-rooftop.png"
  },
  {
    "id": 1,
    "title": "Software Engineering Internship at Lowe's: Week-by-Week",
    "author": "Abel Lu",
    "date": "May 22nd - August 5th, 2023",
    "body": "In the summer of 2023, I worked with Lowe's as part of their 11-week software engineering internship program. This is a high-level summary of each week of my experience during the internship.<br/><br/><b>Week 1:</b> <br/>An onboarding/orientation week. I met my roommates and fellow software engineer interns, set-up my laptop, and learned about how Lowe's operates as a company.<br/><br/><b>Week 2:</b><br/> I learned about Lowe's' tech stack and collaboration methodology (Agile). Lowe's uses some languages and frameworks that I'm familiar with and some that I've never heard of. I'm a big fan of this combination, because I believe it will allow me to contribute with the skills I have while picking up new skills along the way.<br/><br/> <b>Week 3:</b><br/> I was assigned to a tech team at Lowe's. I met my manager, who assigned me a project for the summer, and began researching the the stack that we'd be using to complete our assignment (React, Redux, Material UI, Java Spring, Elasticsearch). My manager made it very clear to me that I was not going to be a coffee runner this summer--my project, if completed successfully, would impact field service technicians in all Lowe's stores across North America.<br/><br/> <b>Week 4:</b><br/> I met virtually with my mentor, who works for Lowe's tech in India. The time difference between India and the United States makes it there's only have a small time window for me to reach out if I need pointers. I see this as a helpful challenge, as it will allow me to have a mentor that I can reach out to while also giving me time to work independently and learn to problem solve on my own. <br/><br/><b>Week 5:</b><br/> I continued working on my project, and it's really begun to take shape. Each day of the week, I implemented new features and made changes based on feedback from my mentor, my manager, and the team's product manager. I've also started tracking my work in Jira, the Agile collaboration platform we use, which has helped me stay accountable for the tasks that I'm responsible for. <br/><br/><b>Week 6:</b><br/>This week, I completed my summer project! I'm scheduled to present it to the team next week. Throughout the week, I refined key features and tested my application to make sure it checked off every box in the acceptance criteria. Once I had thoroughly tested my application, I updated my mentor on my progress.<br/><br/><b>Week 7:</b><br/>After demonstrating my project to my team, I received the green light to submit a pull request. My mentor gave me some feedback on the pull request for finishing touches, and after clearing those checks, the application I created was launched to an internal audience at Lowe's. In the months following the internship, my application will be rolled out to IT service technicians in all 2205 Lowe's stores across North America. That's some pretty exciting stuff!",
    "imageUrl": "https://raw.githubusercontent.com/azn-abel/azn-abel/main/images/Lowes-Logo.png"
  },
  {
    "id": 2,
    "title": "Platform Engineering at RENCI",
    "author": "Abel Lu",
    "date": "Coming Soon",
    "body": "This article is a placeholder for now - I will fill it in as the internship progresses.",
    "imageUrl": "https://raw.githubusercontent.com/azn-abel/azn-abel/main/images/renci-upscaled.png"
  }
]